MikroElektronika/core_packages/PIC/XC8/def/PIC18LF25J11/mcu.h
extern volatile PORTAbits_t PORTAbits __at(0xF80);
// bitfield macros
#define _PORTA_RA0_POSN                                     0x0
#define _PORTA_RA0_POSITION                                 0x0
#define _PORTA_RA0_SIZE                                     0x1
#define _PORTA_RA0_LENGTH                                   0x1
#define _PORTA_RA0_MASK                                     0x1
#define _PORTA_RA1_POSN                                     0x1
#define _PORTA_RA1_POSITION                                 0x1
#define _PORTA_RA1_SIZE                                     0x1
#define _PORTA_RA1_LENGTH                                   0x1
#define _PORTA_RA1_MASK                                     0x2
#define _PORTA_RA2_POSN                                     0x2
#define _PORTA_RA2_POSITION                                 0x2
#define _PORTA_RA2_SIZE                                     0x1
#define _PORTA_RA2_LENGTH                                   0x1
#define _PORTA_RA2_MASK                                     0x4
#define _PORTA_RA3_POSN                                     0x3
#define _PORTA_RA3_POSITION                                 0x3
#define _PORTA_RA3_SIZE                                     0x1
#define _PORTA_RA3_LENGTH                                   0x1
#define _PORTA_RA3_MASK                                     0x8
#define _PORTA_RA5_POSN                                     0x5
#define _PORTA_RA5_POSITION                                 0x5
#define _PORTA_RA5_SIZE                                     0x1
#define _PORTA_RA5_LENGTH                                   0x1
#define _PORTA_RA5_MASK                                     0x20
#define _PORTA_RA6_POSN                                     0x6
#define _PORTA_RA6_POSITION                                 0x6
#define _PORTA_RA6_SIZE                                     0x1
#define _PORTA_RA6_LENGTH                                   0x1
#define _PORTA_RA6_MASK                                     0x40
#define _PORTA_RA7_POSN                                     0x7
#define _PORTA_RA7_POSITION                                 0x7
#define _PORTA_RA7_SIZE                                     0x1
#define _PORTA_RA7_LENGTH                                   0x1
#define _PORTA_RA7_MASK                                     0x80
#define _PORTA_AN0_POSN                                     0x0
#define _PORTA_AN0_POSITION                                 0x0
#define _PORTA_AN0_SIZE                                     0x1
#define _PORTA_AN0_LENGTH                                   0x1
#define _PORTA_AN0_MASK                                     0x1
#define _PORTA_AN1_POSN                                     0x1
#define _PORTA_AN1_POSITION                                 0x1
#define _PORTA_AN1_SIZE                                     0x1
#define _PORTA_AN1_LENGTH                                   0x1
#define _PORTA_AN1_MASK                                     0x2
#define _PORTA_AN2_POSN                                     0x2
#define _PORTA_AN2_POSITION                                 0x2
#define _PORTA_AN2_SIZE                                     0x1
#define _PORTA_AN2_LENGTH                                   0x1
#define _PORTA_AN2_MASK                                     0x4
#define _PORTA_AN3_POSN                                     0x3
#define _PORTA_AN3_POSITION                                 0x3
#define _PORTA_AN3_SIZE                                     0x1
#define _PORTA_AN3_LENGTH                                   0x1
#define _PORTA_AN3_MASK                                     0x8
#define _PORTA_AN4_POSN                                     0x5
#define _PORTA_AN4_POSITION                                 0x5
#define _PORTA_AN4_SIZE                                     0x1
#define _PORTA_AN4_LENGTH                                   0x1
#define _PORTA_AN4_MASK                                     0x20
#define _PORTA_OSC2_POSN                                    0x6
#define _PORTA_OSC2_POSITION                                0x6
#define _PORTA_OSC2_SIZE                                    0x1
#define _PORTA_OSC2_LENGTH                                  0x1
#define _PORTA_OSC2_MASK                                    0x40
#define _PORTA_OSC1_POSN                                    0x7
#define _PORTA_OSC1_POSITION                                0x7
#define _PORTA_OSC1_SIZE                                    0x1
#define _PORTA_OSC1_LENGTH                                  0x1
#define _PORTA_OSC1_MASK                                    0x80
#define _PORTA_NOT_SS1_POSN                                 0x5
#define _PORTA_NOT_SS1_POSITION                             0x5
#define _PORTA_NOT_SS1_SIZE                                 0x1
#define _PORTA_NOT_SS1_LENGTH                               0x1
#define _PORTA_NOT_SS1_MASK                                 0x20
#define _PORTA_C1INA_POSN                                   0x0
#define _PORTA_C1INA_POSITION                               0x0
#define _PORTA_C1INA_SIZE                                   0x1
#define _PORTA_C1INA_LENGTH                                 0x1
#define _PORTA_C1INA_MASK                                   0x1
#define _PORTA_C2INA_POSN                                   0x1
#define _PORTA_C2INA_POSITION                               0x1
#define _PORTA_C2INA_SIZE                                   0x1
#define _PORTA_C2INA_LENGTH                                 0x1
#define _PORTA_C2INA_MASK                                   0x2
#define _PORTA_VREF_MINUS_POSN                              0x2
#define _PORTA_VREF_MINUS_POSITION                          0x2
#define _PORTA_VREF_MINUS_SIZE                              0x1
#define _PORTA_VREF_MINUS_LENGTH                            0x1
#define _PORTA_VREF_MINUS_MASK                              0x4
#define _PORTA_VREF_PLUS_POSN                               0x3
#define _PORTA_VREF_PLUS_POSITION                           0x3
#define _PORTA_VREF_PLUS_SIZE                               0x1
#define _PORTA_VREF_PLUS_LENGTH                             0x1
#define _PORTA_VREF_PLUS_MASK                               0x8
#define _PORTA_nSS1_POSN                                    0x5
#define _PORTA_nSS1_POSITION                                0x5
#define _PORTA_nSS1_SIZE                                    0x1
#define _PORTA_nSS1_LENGTH                                  0x1
#define _PORTA_nSS1_MASK                                    0x20
#define _PORTA_CLKO_POSN                                    0x6
#define _PORTA_CLKO_POSITION                                0x6
#define _PORTA_CLKO_SIZE                                    0x1
#define _PORTA_CLKO_LENGTH                                  0x1
#define _PORTA_CLKO_MASK                                    0x40
#define _PORTA_CLKI_POSN                                    0x7
#define _PORTA_CLKI_POSITION                                0x7
#define _PORTA_CLKI_SIZE                                    0x1
#define _PORTA_CLKI_LENGTH                                  0x1
#define _PORTA_CLKI_MASK                                    0x80
#define _PORTA_ULPWU_POSN                                   0x0
#define _PORTA_ULPWU_POSITION                               0x0
#define _PORTA_ULPWU_SIZE                                   0x1
#define _PORTA_ULPWU_LENGTH                                 0x1
#define _PORTA_ULPWU_MASK                                   0x1
#define _PORTA_CVREF_MINUS_POSN                             0x2
#define _PORTA_CVREF_MINUS_POSITION                         0x2
#define _PORTA_CVREF_MINUS_SIZE                             0x1
#define _PORTA_CVREF_MINUS_LENGTH                           0x1
#define _PORTA_CVREF_MINUS_MASK                             0x4
#define _PORTA_C1INB_POSN                                   0x3
#define _PORTA_C1INB_POSITION                               0x3
#define _PORTA_C1INB_SIZE                                   0x1
#define _PORTA_C1INB_LENGTH                                 0x1
#define _PORTA_C1INB_MASK                                   0x8
#define _PORTA_HLVDIN_POSN                                  0x5
#define _PORTA_HLVDIN_POSITION                              0x5
#define _PORTA_HLVDIN_SIZE                                  0x1
#define _PORTA_HLVDIN_LENGTH                                0x1
#define _PORTA_HLVDIN_MASK                                  0x20
#define _PORTA_RP0_POSN                                     0x0
#define _PORTA_RP0_POSITION                                 0x0
#define _PORTA_RP0_SIZE                                     0x1
#define _PORTA_RP0_LENGTH                                   0x1
#define _PORTA_RP0_MASK                                     0x1
#define _PORTA_RP1_POSN                                     0x1
#define _PORTA_RP1_POSITION                                 0x1
#define _PORTA_RP1_SIZE                                     0x1
#define _PORTA_RP1_LENGTH                                   0x1
#define _PORTA_RP1_MASK                                     0x2
#define _PORTA_C2INB_POSN                                   0x2
#define _PORTA_C2INB_POSITION                               0x2
#define _PORTA_C2INB_SIZE                                   0x1
#define _PORTA_C2INB_LENGTH                                 0x1
#define _PORTA_C2INB_MASK                                   0x4
#define _PORTA_RP2_POSN                                     0x5
#define _PORTA_RP2_POSITION                                 0x5
#define _PORTA_RP2_SIZE                                     0x1
#define _PORTA_RP2_LENGTH                                   0x1
#define _PORTA_RP2_MASK                                     0x20
#define _PORTA_ULPWUIN_POSN                                 0x0
#define _PORTA_ULPWUIN_POSITION                             0x0
#define _PORTA_ULPWUIN_SIZE                                 0x1
#define _PORTA_ULPWUIN_LENGTH                               0x1
#define _PORTA_ULPWUIN_MASK                                 0x1
#define _PORTA_LVDIN_POSN                                   0x5
#define _PORTA_LVDIN_POSITION                               0x5
#define _PORTA_LVDIN_SIZE                                   0x1
#define _PORTA_LVDIN_LENGTH                                 0x1
#define _PORTA_LVDIN_MASK                                   0x20
#define _PORTA_RJPU_POSN                                    0x7
#define _PORTA_RJPU_POSITION                                0x7
#define _PORTA_RJPU_SIZE                                    0x1
#define _PORTA_RJPU_LENGTH                                  0x1
#define _PORTA_RJPU_MASK                                    0x80

// Register: PORTB
#define PORTB PORTB
extern volatile unsigned char           PORTB               __at(0xF81);
#ifndef _LIB_BUILD
asm("PORTB equ 0F81h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RB2                    :1;
        unsigned RB3                    :1;
        unsigned RB4                    :1;
        unsigned RB5                    :1;
        unsigned RB6                    :1;
        unsigned RB7                    :1;
    };
    struct {
        unsigned AN12                   :1;
        unsigned AN10                   :1;
        unsigned AN8                    :1;
        unsigned AN9                    :1;
        unsigned                        :2;
        unsigned KBI2                   :1;
        unsigned KBI3                   :1;
    };
    struct {
        unsigned INT0                   :1;
        unsigned                        :1;
        unsigned CTEDG1                 :1;
        unsigned CTEDG2                 :1;
        unsigned KBI0                   :1;
        unsigned KBI1                   :1;
        unsigned PGC                    :1;
        unsigned PGD                    :1;
    };
    struct {
        unsigned RP3                    :1;
        unsigned RTCC                   :1;
        unsigned                        :4;
        unsigned RP9                    :1;
        unsigned RP10                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned RP4                    :1;
    };
    struct {
        unsigned                        :2;
        unsigned REFO                   :1;
        unsigned RP6                    :1;
        unsigned RP7                    :1;
        unsigned RP8                    :1;
    };
    struct {
        unsigned                        :2;
        unsigned RP5                    :1;
    };
    struct {
        unsigned                        :3;
        unsigned CCP2_PA2               :1;
    };
} PORTBbits_t;
extern volatile PORTBbits_t PORTBbits __at(0xF81);
// bitfield macros
#define _PORTB_RB0_POSN                                     0x0
#define _PORTB_RB0_POSITION                                 0x0
#define _PORTB_RB0_SIZE                                     0x1
#define _PORTB_RB0_LENGTH                                   0x1
#define _PORTB_RB0_MASK                                     0x1
#define _PORTB_RB1_POSN                                     0x1
#define _PORTB_RB1_POSITION                                 0x1
#define _PORTB_RB1_SIZE                                     0x1
#define _PORTB_RB1_LENGTH                                   0x1
#define _PORTB_RB1_MASK                                     0x2
#define _PORTB_RB2_POSN                                     0x2
#define _PORTB_RB2_POSITION                                 0x2
#define _PORTB_RB2_SIZE                                     0x1
#define _PORTB_RB2_LENGTH                                   0x1
#define _PORTB_RB2_MASK                                     0x4
#define _PORTB_RB3_POSN                                     0x3
#define _PORTB_RB3_POSITION                                 0x3
#define _PORTB_RB3_SIZE                                     0x1
#define _PORTB_RB3_LENGTH                                   0x1
#define _PORTB_RB3_MASK                                     0x8
#define _PORTB_RB4_POSN                                     0x4
#define _PORTB_RB4_POSITION                                 0x4
#define _PORTB_RB4_SIZE                                     0x1
#define _PORTB_RB4_LENGTH                                   0x1
#define _PORTB_RB4_MASK                                     0x10
#define _PORTB_RB5_POSN                                     0x5
#define _PORTB_RB5_POSITION                                 0x5
#define _PORTB_RB5_SIZE                                     0x1
#define _PORTB_RB5_LENGTH                                   0x1
#define _PORTB_RB5_MASK                                     0x20
#define _PORTB_RB6_POSN                                     0x6
#define _PORTB_RB6_POSITION                                 0x6
#define _PORTB_RB6_SIZE                                     0x1
#define _PORTB_RB6_LENGTH                                   0x1
#define _PORTB_RB6_MASK                                     0x40
#define _PORTB_RB7_POSN                                     0x7
#define _PORTB_RB7_POSITION                                 0x7
#define _PORTB_RB7_SIZE                                     0x1
#define _PORTB_RB7_LENGTH                                   0x1
#define _PORTB_RB7_MASK                                     0x80
#define _PORTB_AN12_POSN                                    0x0
#define _PORTB_AN12_POSITION                                0x0
#define _PORTB_AN12_SIZE                                    0x1
#define _PORTB_AN12_LENGTH                                  0x1
#define _PORTB_AN12_MASK                                    0x1
#define _PORTB_AN10_POSN                                    0x1
#define _PORTB_AN10_POSITION                                0x1
#define _PORTB_AN10_SIZE                                    0x1
#define _PORTB_AN10_LENGTH                                  0x1
#define _PORTB_AN10_MASK                                    0x2
#define _PORTB_AN8_POSN                                     0x2
#define _PORTB_AN8_POSITION                                 0x2
#define _PORTB_AN8_SIZE                                     0x1
#define _PORTB_AN8_LENGTH                                   0x1
#define _PORTB_AN8_MASK                                     0x4
#define _PORTB_AN9_POSN                                     0x3
#define _PORTB_AN9_POSITION                                 0x3
#define _PORTB_AN9_SIZE                                     0x1
#define _PORTB_AN9_LENGTH                                   0x1
#define _PORTB_AN9_MASK                                     0x8
#define _PORTB_KBI2_POSN                                    0x6
#define _PORTB_KBI2_POSITION                                0x6
#define _PORTB_KBI2_SIZE                                    0x1
#define _PORTB_KBI2_LENGTH                                  0x1
#define _PORTB_KBI2_MASK                                    0x40
#define _PORTB_KBI3_POSN                                    0x7
#define _PORTB_KBI3_POSITION                                0x7
#define _PORTB_KBI3_SIZE                                    0x1
#define _PORTB_KBI3_LENGTH                                  0x1
#define _PORTB_KBI3_MASK                                    0x80
#define _PORTB_INT0_POSN                                    0x0
#define _PORTB_INT0_POSITION                                0x0
#define _PORTB_INT0_SIZE                                    0x1
#define _PORTB_INT0_LENGTH                                  0x1
#define _PORTB_INT0_MASK                                    0x1
#define _PORTB_CTEDG1_POSN                                  0x2
#define _PORTB_CTEDG1_POSITION                              0x2
#define _PORTB_CTEDG1_SIZE                                  0x1
#define _PORTB_CTEDG1_LENGTH                                0x1
#define _PORTB_CTEDG1_MASK                                  0x4
#define _PORTB_CTEDG2_POSN                                  0x3
#define _PORTB_CTEDG2_POSITION                              0x3
#define _PORTB_CTEDG2_SIZE                                  0x1
#define _PORTB_CTEDG2_LENGTH                                0x1
#define _PORTB_CTEDG2_MASK                                  0x8
#define _PORTB_KBI0_POSN                                    0x4
#define _PORTB_KBI0_POSITION                                0x4
#define _PORTB_KBI0_SIZE                                    0x1
#define _PORTB_KBI0_LENGTH                                  0x1
#define _PORTB_KBI0_MASK                                    0x10
#define _PORTB_KBI1_POSN                                    0x5
#define _PORTB_KBI1_POSITION                                0x5
#define _PORTB_KBI1_SIZE                                    0x1
#define _PORTB_KBI1_LENGTH                                  0x1
#define _PORTB_KBI1_MASK                                    0x20
#define _PORTB_PGC_POSN                                     0x6
#define _PORTB_PGC_POSITION                                 0x6
#define _PORTB_PGC_SIZE                                     0x1
#define _PORTB_PGC_LENGTH                                   0x1
#define _PORTB_PGC_MASK                                     0x40
#define _PORTB_PGD_POSN                                     0x7
#define _PORTB_PGD_POSITION                                 0x7
#define _PORTB_PGD_SIZE                                     0x1
#define _PORTB_PGD_LENGTH                                   0x1
#define _PORTB_PGD_MASK                                     0x80
#define _PORTB_RP3_POSN                                     0x0
#define _PORTB_RP3_POSITION                                 0x0
#define _PORTB_RP3_SIZE                                     0x1
#define _PORTB_RP3_LENGTH                                   0x1
#define _PORTB_RP3_MASK                                     0x1
#define _PORTB_RTCC_POSN                                    0x1
#define _PORTB_RTCC_POSITION                                0x1
#define _PORTB_RTCC_SIZE                                    0x1
#define _PORTB_RTCC_LENGTH                                  0x1
#define _PORTB_RTCC_MASK                                    0x2
#define _PORTB_RP9_POSN                                     0x6
#define _PORTB_RP9_POSITION                                 0x6
#define _PORTB_RP9_SIZE                                     0x1
#define _PORTB_RP9_LENGTH                                   0x1
#define _PORTB_RP9_MASK                                     0x40
#define _PORTB_RP10_POSN                                    0x7
#define _PORTB_RP10_POSITION                                0x7
#define _PORTB_RP10_SIZE                                    0x1
#define _PORTB_RP10_LENGTH                                  0x1
#define _PORTB_RP10_MASK                                    0x80
#define _PORTB_RP4_POSN                                     0x1
#define _PORTB_RP4_POSITION                                 0x1
#define _PORTB_RP4_SIZE                                     0x1
#define _PORTB_RP4_LENGTH                                   0x1
#define _PORTB_RP4_MASK                                     0x2
#define _PORTB_REFO_POSN                                    0x2
#define _PORTB_REFO_POSITION                                0x2
#define _PORTB_REFO_SIZE                                    0x1
#define _PORTB_REFO_LENGTH                                  0x1
#define _PORTB_REFO_MASK                                    0x4
#define _PORTB_RP6_POSN                                     0x3
#define _PORTB_RP6_POSITION                                 0x3
#define _PORTB_RP6_SIZE                                     0x1
#define _PORTB_RP6_LENGTH                                   0x1
#define _PORTB_RP6_MASK                                     0x8
#define _PORTB_RP7_POSN                                     0x4
#define _PORTB_RP7_POSITION                                 0x4
#define _PORTB_RP7_SIZE                                     0x1
#define _PORTB_RP7_LENGTH                                   0x1
#define _PORTB_RP7_MASK                                     0x10
#define _PORTB_RP8_POSN                                     0x5
#define _PORTB_RP8_POSITION                                 0x5
#define _PORTB_RP8_SIZE                                     0x1
#define _PORTB_RP8_LENGTH                                   0x1
#define _PORTB_RP8_MASK                                     0x20
#define _PORTB_RP5_POSN                                     0x2
#define _PORTB_RP5_POSITION                                 0x2
#define _PORTB_RP5_SIZE                                     0x1
#define _PORTB_RP5_LENGTH                                   0x1
#define _PORTB_RP5_MASK                                     0x4
#define _PORTB_CCP2_PA2_POSN                                0x3
#define _PORTB_CCP2_PA2_POSITION                            0x3
#define _PORTB_CCP2_PA2_SIZE                                0x1
#define _PORTB_CCP2_PA2_LENGTH                              0x1
#define _PORTB_CCP2_PA2_MASK                                0x8

