MikroElektronika/core_packages/PIC/XC8/def/PIC18LF25J11/mcu.h
// IPR1<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x7CFA);	// @ (0xF9F * 8 + 2)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR1,2)
// CCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0x7DD0);	// @ (0xFBA * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0x7DD1);	// @ (0xFBA * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0x7DD2);	// @ (0xFBA * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0x7DD3);	// @ (0xFBA * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1X>
extern volatile __bit                   CCP1X               __at(0x7DD5);	// @ (0xFBA * 8 + 5)
#define                                 CCP1X_bit           _BIT_ACCESS(CCP1CON,5)
// CCP1CON<CCP1Y>
extern volatile __bit                   CCP1Y               __at(0x7DD4);	// @ (0xFBA * 8 + 4)
#define                                 CCP1Y_bit           _BIT_ACCESS(CCP1CON,4)
// PORTC<CCP2>
extern volatile __bit                   CCP2                __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 CCP2_bit            _BIT_ACCESS(PORTC,1)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x7D00);	// @ (0xFA0 * 8 + 0)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x7D08);	// @ (0xFA1 * 8 + 0)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,0)
// IPR2<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x7D10);	// @ (0xFA2 * 8 + 0)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR2,0)
// CCP2CON<CCP2M0>
extern volatile __bit                   CCP2M0              __at(0x7DA0);	// @ (0xFB4 * 8 + 0)
#define                                 CCP2M0_bit          _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2M1>
extern volatile __bit                   CCP2M1              __at(0x7DA1);	// @ (0xFB4 * 8 + 1)
#define                                 CCP2M1_bit          _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2M2>
extern volatile __bit                   CCP2M2              __at(0x7DA2);	// @ (0xFB4 * 8 + 2)
#define                                 CCP2M2_bit          _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2M3>
extern volatile __bit                   CCP2M3              __at(0x7DA3);	// @ (0xFB4 * 8 + 3)
#define                                 CCP2M3_bit          _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2X>
extern volatile __bit                   CCP2X               __at(0x7DA5);	// @ (0xFB4 * 8 + 5)
#define                                 CCP2X_bit           _BIT_ACCESS(CCP2CON,5)
// CCP2CON<CCP2Y>
extern volatile __bit                   CCP2Y               __at(0x7DA4);	// @ (0xFB4 * 8 + 4)
#define                                 CCP2Y_bit           _BIT_ACCESS(CCP2CON,4)
// PORTB<CCP2_PA2>
extern volatile __bit                   CCP2_PA2            __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 CCP2_PA2_bit        _BIT_ACCESS(PORTB,3)
// ALRMCFG<CHIME>
extern volatile __bit                   CHIME               __at(0x7C8E);	// @ (0xF91 * 8 + 6)
#define                                 CHIME_bit           _BIT_ACCESS(ALRMCFG,6)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x7E12);	// @ (0xFC2 * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x7E13);	// @ (0xFC2 * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x7E14);	// @ (0xFC2 * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x7E15);	// @ (0xFC2 * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// ADCON1<CHSN3>
extern volatile __bit                   CHSN3               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 CHSN3_bit           _BIT_ACCESS(ADCON1,3)
// PORTC<CK1>
extern volatile __bit                   CK1                 __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 CK1_bit             _BIT_ACCESS(PORTC,6)
// SSP1STAT<CKE>
extern volatile __bit _DEPRECATED       CKE                 __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSP1STAT,6)
// SSP1STAT<CKE1>
extern volatile __bit                   CKE1                __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 CKE1_bit            _BIT_ACCESS(SSP1STAT,6)
// SSP2STAT<CKE2>
extern volatile __bit                   CKE2                __at(0x7B9E);	// @ (0xF73 * 8 + 6)
#define                                 CKE2_bit            _BIT_ACCESS(SSP2STAT,6)
// SSP1CON1<CKP>
extern volatile __bit _DEPRECATED       CKP                 __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSP1CON1,4)
// SSP1CON1<CKP1>
extern volatile __bit                   CKP1                __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 CKP1_bit            _BIT_ACCESS(SSP1CON1,4)
// SSP2CON1<CKP2>
extern volatile __bit                   CKP2                __at(0x7B94);	// @ (0xF72 * 8 + 4)
#define                                 CKP2_bit            _BIT_ACCESS(SSP2CON1,4)
// BAUDCON1<CKTXP>
extern volatile __bit                   CKTXP               __at(0x7BF4);	// @ (0xF7E * 8 + 4)
#define                                 CKTXP_bit           _BIT_ACCESS(BAUDCON1,4)
// PORTA<CLKI>
extern volatile __bit                   CLKI                __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 CLKI_bit            _BIT_ACCESS(PORTA,7)
// PORTA<CLKO>
extern volatile __bit                   CLKO                __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 CLKO_bit            _BIT_ACCESS(PORTA,6)
// RCON<CM>
extern volatile __bit                   CM                  __at(0x7E85);	// @ (0xFD0 * 8 + 5)
#define                                 CM_bit              _BIT_ACCESS(RCON,5)
// PIE2<CM1IE>
extern volatile __bit                   CM1IE               __at(0x7D05);	// @ (0xFA0 * 8 + 5)
#define                                 CM1IE_bit           _BIT_ACCESS(PIE2,5)
// PIR2<CM1IF>
extern volatile __bit                   CM1IF               __at(0x7D0D);	// @ (0xFA1 * 8 + 5)
#define                                 CM1IF_bit           _BIT_ACCESS(PIR2,5)
// IPR2<CM1IP>
extern volatile __bit                   CM1IP               __at(0x7D15);	// @ (0xFA2 * 8 + 5)
#define                                 CM1IP_bit           _BIT_ACCESS(IPR2,5)
// PIE2<CM2IE>
extern volatile __bit                   CM2IE               __at(0x7D06);	// @ (0xFA0 * 8 + 6)
#define                                 CM2IE_bit           _BIT_ACCESS(PIE2,6)
// PIR2<CM2IF>
extern volatile __bit                   CM2IF               __at(0x7D0E);	// @ (0xFA1 * 8 + 6)
#define                                 CM2IF_bit           _BIT_ACCESS(PIR2,6)
// IPR2<CM2IP>
extern volatile __bit                   CM2IP               __at(0x7D16);	// @ (0xFA2 * 8 + 6)
#define                                 CM2IP_bit           _BIT_ACCESS(IPR2,6)
// PIE2<CMIE>
extern volatile __bit                   CMIE                __at(0x7D06);	// @ (0xFA0 * 8 + 6)
#define                                 CMIE_bit            _BIT_ACCESS(PIE2,6)
// PIR2<CMIF>
extern volatile __bit                   CMIF                __at(0x7D0E);	// @ (0xFA1 * 8 + 6)
#define                                 CMIF_bit            _BIT_ACCESS(PIR2,6)
// IPR2<CMIP>
extern volatile __bit                   CMIP                __at(0x7D16);	// @ (0xFA2 * 8 + 6)
#define                                 CMIP_bit            _BIT_ACCESS(IPR2,6)
// PSTR1CON<CMPL0>
extern volatile __bit _DEPRECATED       CMPL0               __at(0x7DFE);	// @ (0xFBF * 8 + 6)
#define                                 CMPL0_bit           _BIT_ACCESS(PSTR1CON,6)
// PSTR2CON<CMPL02>
extern volatile __bit                   CMPL02              __at(0x7DCE);	// @ (0xFB9 * 8 + 6)
#define                                 CMPL02_bit          _BIT_ACCESS(PSTR2CON,6)
// PSTR1CON<CMPL1>
extern volatile __bit _DEPRECATED       CMPL1               __at(0x7DFF);	// @ (0xFBF * 8 + 7)
#define                                 CMPL1_bit           _BIT_ACCESS(PSTR1CON,7)
// PSTR2CON<CMPL12>
extern volatile __bit                   CMPL12              __at(0x7DCF);	// @ (0xFB9 * 8 + 7)
#define                                 CMPL12_bit          _BIT_ACCESS(PSTR2CON,7)
// CM1CON<COE>
extern volatile __bit _DEPRECATED       COE                 __at(0x7E96);	// @ (0xFD2 * 8 + 6)
#define                                 COE_bit             _BIT_ACCESS(CM1CON,6)
// CM1CON<COE1>
extern volatile __bit                   COE1                __at(0x7E96);	// @ (0xFD2 * 8 + 6)
#define                                 COE1_bit            _BIT_ACCESS(CM1CON,6)
// CM2CON<COE2>
extern volatile __bit                   COE2                __at(0x7E8E);	// @ (0xFD1 * 8 + 6)
#define                                 COE2_bit            _BIT_ACCESS(CM2CON,6)
// CM1CON<CON>
extern volatile __bit _DEPRECATED       CON                 __at(0x7E97);	// @ (0xFD2 * 8 + 7)
#define                                 CON_bit             _BIT_ACCESS(CM1CON,7)
// CM1CON<CON1>
extern volatile __bit                   CON1                __at(0x7E97);	// @ (0xFD2 * 8 + 7)
#define                                 CON1_bit            _BIT_ACCESS(CM1CON,7)
// CM2CON<CON2>
extern volatile __bit                   CON2                __at(0x7E8F);	// @ (0xFD1 * 8 + 7)
#define                                 CON2_bit            _BIT_ACCESS(CM2CON,7)
// CMSTAT<COUT1>
extern volatile __bit                   COUT1               __at(0x7B80);	// @ (0xF70 * 8 + 0)
#define                                 COUT1_bit           _BIT_ACCESS(CMSTAT,0)
// CMSTAT<COUT2>
extern volatile __bit                   COUT2               __at(0x7B81);	// @ (0xF70 * 8 + 1)
#define                                 COUT2_bit           _BIT_ACCESS(CMSTAT,1)
// CM1CON<CPOL>
extern volatile __bit _DEPRECATED       CPOL                __at(0x7E95);	// @ (0xFD2 * 8 + 5)
#define                                 CPOL_bit            _BIT_ACCESS(CM1CON,5)
// CM1CON<CPOL1>
extern volatile __bit                   CPOL1               __at(0x7E95);	// @ (0xFD2 * 8 + 5)
#define                                 CPOL1_bit           _BIT_ACCESS(CM1CON,5)
// CM2CON<CPOL2>
extern volatile __bit                   CPOL2               __at(0x7E8D);	// @ (0xFD1 * 8 + 5)
#define                                 CPOL2_bit           _BIT_ACCESS(CM2CON,5)
// CM1CON<CREF>
extern volatile __bit _DEPRECATED       CREF                __at(0x7E92);	// @ (0xFD2 * 8 + 2)
#define                                 CREF_bit            _BIT_ACCESS(CM1CON,2)
// CM1CON<CREF1>
extern volatile __bit                   CREF1               __at(0x7E92);	// @ (0xFD2 * 8 + 2)
#define                                 CREF1_bit           _BIT_ACCESS(CM1CON,2)
// CM2CON<CREF2>
extern volatile __bit                   CREF2               __at(0x7E8A);	// @ (0xFD1 * 8 + 2)
#define                                 CREF2_bit           _BIT_ACCESS(CM2CON,2)
// RCSTA1<CREN>
extern volatile __bit _DEPRECATED       CREN                __at(0x7D64);	// @ (0xFAC * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RCSTA1,4)
// RCSTA1<CREN1>
extern volatile __bit                   CREN1               __at(0x7D64);	// @ (0xFAC * 8 + 4)
#define                                 CREN1_bit           _BIT_ACCESS(RCSTA1,4)
// RCSTA2<CREN2>
extern volatile __bit                   CREN2               __at(0x7CE4);	// @ (0xF9C * 8 + 4)
#define                                 CREN2_bit           _BIT_ACCESS(RCSTA2,4)
// TXSTA1<CSRC>
extern volatile __bit _DEPRECATED       CSRC                __at(0x7D6F);	// @ (0xFAD * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TXSTA1,7)
// TXSTA1<CSRC1>
extern volatile __bit                   CSRC1               __at(0x7D6F);	// @ (0xFAD * 8 + 7)
#define                                 CSRC1_bit           _BIT_ACCESS(TXSTA1,7)
// TXSTA2<CSRC2>
extern volatile __bit                   CSRC2               __at(0x7D47);	// @ (0xFA8 * 8 + 7)
#define                                 CSRC2_bit           _BIT_ACCESS(TXSTA2,7)
// PORTB<CTEDG1>
extern volatile __bit                   CTEDG1              __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 CTEDG1_bit          _BIT_ACCESS(PORTB,2)
// PORTB<CTEDG2>
extern volatile __bit                   CTEDG2              __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 CTEDG2_bit          _BIT_ACCESS(PORTB,3)
// CTMUCONH<CTMUEN>
extern volatile __bit                   CTMUEN              __at(0x7D9F);	// @ (0xFB3 * 8 + 7)
#define                                 CTMUEN_bit          _BIT_ACCESS(CTMUCONH,7)
// PIE3<CTMUIE>
extern volatile __bit                   CTMUIE              __at(0x7D1A);	// @ (0xFA3 * 8 + 2)
#define                                 CTMUIE_bit          _BIT_ACCESS(PIE3,2)
// PIR3<CTMUIF>
extern volatile __bit                   CTMUIF              __at(0x7D22);	// @ (0xFA4 * 8 + 2)
#define                                 CTMUIF_bit          _BIT_ACCESS(PIR3,2)
// IPR3<CTMUIP>
extern volatile __bit                   CTMUIP              __at(0x7D2A);	// @ (0xFA5 * 8 + 2)
#define                                 CTMUIP_bit          _BIT_ACCESS(IPR3,2)
// CTMUCONH<CTMUSIDL>
extern volatile __bit                   CTMUSIDL            __at(0x7D9D);	// @ (0xFB3 * 8 + 5)
#define                                 CTMUSIDL_bit        _BIT_ACCESS(CTMUCONH,5)
// PORTC<CTPLS>
extern volatile __bit                   CTPLS               __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 CTPLS_bit           _BIT_ACCESS(PORTC,2)
// CTMUCONH<CTTRIG>
extern volatile __bit                   CTTRIG              __at(0x7D98);	// @ (0xFB3 * 8 + 0)
#define                                 CTTRIG_bit          _BIT_ACCESS(CTMUCONH,0)
// CVRCON<CVR0>
extern volatile __bit                   CVR0                __at(0x7A98);	// @ (0xF53 * 8 + 0)
#define                                 CVR0_bit            _BIT_ACCESS(CVRCON,0)
// CVRCON<CVR1>
extern volatile __bit                   CVR1                __at(0x7A99);	// @ (0xF53 * 8 + 1)
#define                                 CVR1_bit            _BIT_ACCESS(CVRCON,1)
// CVRCON<CVR2>
extern volatile __bit                   CVR2                __at(0x7A9A);	// @ (0xF53 * 8 + 2)
#define                                 CVR2_bit            _BIT_ACCESS(CVRCON,2)
// CVRCON<CVR3>
extern volatile __bit                   CVR3                __at(0x7A9B);	// @ (0xF53 * 8 + 3)
#define                                 CVR3_bit            _BIT_ACCESS(CVRCON,3)
// PORTA<CVREF_MINUS>
extern volatile __bit                   CVREF_MINUS         __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 CVREF_MINUS_bit     _BIT_ACCESS(PORTA,2)
// CVRCON<CVREN>
extern volatile __bit                   CVREN               __at(0x7A9F);	// @ (0xF53 * 8 + 7)
#define                                 CVREN_bit           _BIT_ACCESS(CVRCON,7)
// CVRCON<CVROE>
extern volatile __bit                   CVROE               __at(0x7A9E);	// @ (0xF53 * 8 + 6)
#define                                 CVROE_bit           _BIT_ACCESS(CVRCON,6)
// CVRCON<CVROEN>
extern volatile __bit                   CVROEN              __at(0x7A9E);	// @ (0xF53 * 8 + 6)
#define                                 CVROEN_bit          _BIT_ACCESS(CVRCON,6)
// CVRCON<CVRR>
extern volatile __bit                   CVRR                __at(0x7A9D);	// @ (0xF53 * 8 + 5)
#define                                 CVRR_bit            _BIT_ACCESS(CVRCON,5)
// CVRCON<CVRSS>
extern volatile __bit                   CVRSS               __at(0x7A9C);	// @ (0xF53 * 8 + 4)
#define                                 CVRSS_bit           _BIT_ACCESS(CVRCON,4)
// SSP1STAT<DA>
extern volatile __bit                   DA                  __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DA_bit              _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<DA1>
extern volatile __bit                   DA1                 __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DA1_bit             _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DA2>
extern volatile __bit                   DA2                 __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 DA2_bit             _BIT_ACCESS(SSP2STAT,5)
// SSP1STAT<DATA_ADDRESS>
extern volatile __bit                   DATA_ADDRESS        __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DATA_ADDRESS_bit    _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DATA_ADDRESS2>
extern volatile __bit                   DATA_ADDRESS2       __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 DATA_ADDRESS2_bit   _BIT_ACCESS(SSP2STAT,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x7EC1);	// @ (0xFD8 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CCP1CON<DC1B0>
extern volatile __bit                   DC1B0               __at(0x7DD4);	// @ (0xFBA * 8 + 4)
#define                                 DC1B0_bit           _BIT_ACCESS(CCP1CON,4)
// CCP1CON<DC1B1>
extern volatile __bit                   DC1B1               __at(0x7DD5);	// @ (0xFBA * 8 + 5)
#define                                 DC1B1_bit           _BIT_ACCESS(CCP1CON,5)
// CCP2CON<DC2B0>
extern volatile __bit                   DC2B0               __at(0x7DA4);	// @ (0xFB4 * 8 + 4)
#define                                 DC2B0_bit           _BIT_ACCESS(CCP2CON,4)
// CCP2CON<DC2B1>
extern volatile __bit                   DC2B1               __at(0x7DA5);	// @ (0xFB4 * 8 + 5)
#define                                 DC2B1_bit           _BIT_ACCESS(CCP2CON,5)
// DMACON2<DLYCYC0>
extern volatile __bit                   DLYCYC0             __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 DLYCYC0_bit         _BIT_ACCESS(DMACON2,4)
// DMACON2<DLYCYC1>
extern volatile __bit                   DLYCYC1             __at(0x7C35);	// @ (0xF86 * 8 + 5)
#define                                 DLYCYC1_bit         _BIT_ACCESS(DMACON2,5)
// DMACON2<DLYCYC2>
extern volatile __bit                   DLYCYC2             __at(0x7C36);	// @ (0xF86 * 8 + 6)
#define                                 DLYCYC2_bit         _BIT_ACCESS(DMACON2,6)
// DMACON2<DLYCYC3>
extern volatile __bit                   DLYCYC3             __at(0x7C37);	// @ (0xF86 * 8 + 7)
#define                                 DLYCYC3_bit         _BIT_ACCESS(DMACON2,7)
// DMACON1<DLYINTEN>
extern volatile __bit                   DLYINTEN            __at(0x7C41);	// @ (0xF88 * 8 + 1)
#define                                 DLYINTEN_bit        _BIT_ACCESS(DMACON1,1)
// DMACON1<DMAEN>
extern volatile __bit                   DMAEN               __at(0x7C40);	// @ (0xF88 * 8 + 0)
#define                                 DMAEN_bit           _BIT_ACCESS(DMACON1,0)
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 DONE_bit            _BIT_ACCESS(ADCON0,1)
// WDTCON<DS>
extern volatile __bit                   DS                  __at(0x7E03);	// @ (0xFC0 * 8 + 3)
#define                                 DS_bit              _BIT_ACCESS(WDTCON,3)
// DSCONL<DSBOR>
extern volatile __bit                   DSBOR               __at(0x7A61);	// @ (0xF4C * 8 + 1)
#define                                 DSBOR_bit           _BIT_ACCESS(DSCONL,1)
// DSCONH<DSEN>
extern volatile __bit                   DSEN                __at(0x7A6F);	// @ (0xF4D * 8 + 7)
#define                                 DSEN_bit            _BIT_ACCESS(DSCONH,7)
// DSWAKEL<DSFLT>
extern volatile __bit                   DSFLT               __at(0x7A57);	// @ (0xF4A * 8 + 7)
#define                                 DSFLT_bit           _BIT_ACCESS(DSWAKEL,7)
// DSWAKEH<DSINT0>
extern volatile __bit                   DSINT0              __at(0x7A58);	// @ (0xF4B * 8 + 0)
#define                                 DSINT0_bit          _BIT_ACCESS(DSWAKEH,0)
// DSWAKEL<DSMCLR>
extern volatile __bit                   DSMCLR              __at(0x7A52);	// @ (0xF4A * 8 + 2)
#define                                 DSMCLR_bit          _BIT_ACCESS(DSWAKEL,2)
// DSWAKEL<DSPOR>
extern volatile __bit                   DSPOR               __at(0x7A50);	// @ (0xF4A * 8 + 0)
#define                                 DSPOR_bit           _BIT_ACCESS(DSWAKEL,0)
// DSWAKEL<DSRTC>
extern volatile __bit                   DSRTC               __at(0x7A53);	// @ (0xF4A * 8 + 3)
#define                                 DSRTC_bit           _BIT_ACCESS(DSWAKEL,3)
// DSWAKEL<DSULP>
extern volatile __bit                   DSULP               __at(0x7A55);	// @ (0xF4A * 8 + 5)
#define                                 DSULP_bit           _BIT_ACCESS(DSWAKEL,5)
// DSCONH<DSULPEN>
extern volatile __bit                   DSULPEN             __at(0x7A69);	// @ (0xF4D * 8 + 1)
#define                                 DSULPEN_bit         _BIT_ACCESS(DSCONH,1)
// DSWAKEL<DSWDT>
extern volatile __bit                   DSWDT               __at(0x7A54);	// @ (0xF4A * 8 + 4)
#define                                 DSWDT_bit           _BIT_ACCESS(DSWAKEL,4)
// PORTC<DT1>
extern volatile __bit                   DT1                 __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 DT1_bit             _BIT_ACCESS(PORTC,7)
// BAUDCON1<DTRXP>
extern volatile __bit                   DTRXP               __at(0x7BF5);	// @ (0xF7E * 8 + 5)
#define                                 DTRXP_bit           _BIT_ACCESS(BAUDCON1,5)
// BAUDCON1<DTRXP1>
extern volatile __bit                   DTRXP1              __at(0x7BF5);	// @ (0xF7E * 8 + 5)
#define                                 DTRXP1_bit          _BIT_ACCESS(BAUDCON1,5)
// BAUDCON2<DTRXP2>
extern volatile __bit                   DTRXP2              __at(0x7BE5);	// @ (0xF7C * 8 + 5)
#define                                 DTRXP2_bit          _BIT_ACCESS(BAUDCON2,5)
// DMACON1<DUPLEX0>
extern volatile __bit                   DUPLEX0             __at(0x7C42);	// @ (0xF88 * 8 + 2)
#define                                 DUPLEX0_bit         _BIT_ACCESS(DMACON1,2)
// DMACON1<DUPLEX1>
extern volatile __bit                   DUPLEX1             __at(0x7C43);	// @ (0xF88 * 8 + 3)
#define                                 DUPLEX1_bit         _BIT_ACCESS(DMACON1,3)
// SSP1STAT<D_A>
extern volatile __bit                   D_A                 __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D_A_bit             _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<D_A2>
extern volatile __bit                   D_A2                __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 D_A2_bit            _BIT_ACCESS(SSP2STAT,5)
// SSP2STAT<D_NOT_A2>
